blogs/use_rest_access_k8s.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-06 日 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用client-go/rest访问k8s</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">使用client-go/rest访问k8s</h1>
<p>
公司的k8s平台使用CR（custom resource）实现个性化需求，监控系统需要获取CR提升可观测性。k8s客户端对标准资源，例如deployment，pod支持比较好，但是对自定义资源的支持弄得我一头雾水。本质上说都是通过http访问资源，我想不如直接使用http库，避免理解过多不必要的概念。
</p>

<p>
通过哪些url访问呢，这可把我难住了，又要陷入理解k8s的概念中去？k8s提供了类似<a href="https://medium.com/programming-kubernetes/building-stuff-with-the-kubernetes-api-1-cc50a3642">资源浏览器的接口</a>，通过这个接口，可以层层下探，找到自己需要的接口。
</p>

<p>
可用通过 <code>kubectl get --raw /</code> 获取根下的接口，然后层层下探，直到找到需要的资源。
</p>

<p>
## kubectl proxy
k8s的接口需要证书访问，curl起来太不方便了，为此可以使用 <code>kubectl proxy --port=8001</code> 启动代理， curl访问代理即可 <code>curl http://127.0.0.1:8080/</code> 。
</p>

<p>
## 使用token
除了证书，使用token也是可以的，先要生成token，然后curl直接访问。
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #a0522d;">APISERVER</span>=$(<span style="color: #ff00ff;">kubectl</span> config view -o <span style="color: #a0522d;">jsonpath</span>=<span style="color: #8b2252;">'{.clusters[*].cluster.server}'</span>)
<span style="color: #a0522d;">TOKEN</span>=$(<span style="color: #ff00ff;">kubectl</span> get secrets -o <span style="color: #a0522d;">jsonpath</span>=<span style="color: #8b2252;">'{.items[?(@.type=="kubernetes.io/service-account-token")].data.token}'</span> | base64 --decode)
curl $<span style="color: #a0522d;">APISERVER</span>/ --header <span style="color: #8b2252;">"Authorization: Bearer $TOKEN"</span> --insecure
</pre>
</div>

<p>
除了使用代理或token访问k8s资源，还可以借助client-go/rest，这种方式直接使用go client，更自然。
</p>

<p>
## 访问标准资源
我们先看看如何访问标准资源，首先获取config，然后构造客户端，最后借助客户端提供的接口就可以访问了。
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;config</span>
<span style="color: #a0522d;">config</span>, <span style="color: #a0522d;">err</span> := clientcmd.<span style="color: #0000ff;">BuildConfigFromFlags</span>(<span style="color: #8b2252;">""</span>, config)
<span style="color: #a020f0;">if</span> err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
}
config.UserAgent = <span style="color: #8b2252;">"data-link/agent"</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#26500;&#36896;&#23458;&#25143;&#31471;&#65292;&#36825;&#20010;&#26469;&#33258; k8s.io/client-go/kubernetes</span>
<span style="color: #a0522d;">clientset</span>, <span style="color: #a0522d;">err</span> := kubernetes.<span style="color: #0000ff;">NewForConfig</span>(config)
<span style="color: #a020f0;">if</span> err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#20351;&#29992;&#23458;&#25143;&#31471;&#33719;&#21462;&#25152;&#26377;&#30340;pod</span>
<span style="color: #a0522d;">pods</span>, <span style="color: #a0522d;">err</span> := clientset.<span style="color: #0000ff;">CoreV1</span>().<span style="color: #0000ff;">Pods</span>(<span style="color: #8b2252;">""</span>).<span style="color: #0000ff;">List</span>(<span style="color: #228b22;">metav1.ListOptions</span>{})
</pre>
</div>

<p>
## 访问自定义资源
标准资源和自定义资源，区别无非在于数据格式是否标准。因为标准，前者可用返回预定义的对象，后者只能返回json格式的[]byte。这里面底层通信是没有区别的。
client-go/rest 正是使用的底层通讯库。
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;config&#65292;&#36825;&#37324;&#38656;&#35201;&#37197;&#32622;&#19979;ContentConfig</span>
<span style="color: #a0522d;">config</span>, <span style="color: #a0522d;">err</span> := clientcmd.<span style="color: #0000ff;">BuildConfigFromFlags</span>(<span style="color: #8b2252;">""</span>, <span style="color: #0000ff;">kubeConfigPath</span>(file))
<span style="color: #a020f0;">if</span> err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
}

config.UserAgent = <span style="color: #8b2252;">"data-link/agent"</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#37197;&#32622;ContentConfig</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#26631;&#20934;&#36164;&#28304;&#21487;&#20197;&#20256;&#20837;&#19981;&#21516;&#30340;ContentConfig&#65292;&#35299;&#26512;&#20986;&#19981;&#21516;&#30340;&#39044;&#23450;&#20041;&#23545;&#35937;&#12290;</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25105;&#21482;&#24819;&#21700;&#39575;&#23427;&#65292;&#36820;&#22238;json</span>
<span style="color: #a0522d;">jsonSerializerInfo</span> := runtime.SerializerInfo {
  <span style="color: #008b8b;">MediaType</span>:        <span style="color: #8b2252;">"application"</span>,
  <span style="color: #008b8b;">MediaTypeType</span>:    <span style="color: #8b2252;">"json"</span>,
  <span style="color: #008b8b;">MediaTypeSubType</span>: <span style="color: #8b2252;">"UTF-8"</span>,
  <span style="color: #008b8b;">EncodesAsText</span>:    <span style="color: #008b8b;">true</span>,
}

config.ContentConfig = <span style="color: #228b22;">rest.ContentConfig</span>{
  <span style="color: #008b8b;">GroupVersion</span>: &amp;<span style="color: #228b22;">schema.GroupVersion</span>{},
  <span style="color: #008b8b;">NegotiatedSerializer</span>: runtime.<span style="color: #0000ff;">NewSimpleNegotiatedSerializer</span>(jsonSerializerInfo),
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#26500;&#36896;&#23458;&#25143;&#31471;&#65292;&#36825;&#20010;&#26469;&#33258; k8s.io/client-go/rest</span>
<span style="color: #a0522d;">client</span>, <span style="color: #a0522d;">err</span> := rest.<span style="color: #0000ff;">RESTClientFor</span>(config)
<span style="color: #a020f0;">if</span> err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#33719;&#21462;&#36164;&#28304;&#65292;uri&#26159;&#23545;&#24212;&#30340;&#36164;&#28304;</span>
<span style="color: #a0522d;">request</span> := client.<span style="color: #0000ff;">Get</span>().<span style="color: #0000ff;">RequestURI</span>(uri)
<span style="color: #a0522d;">result</span> := request.<span style="color: #0000ff;">Do</span>(context.<span style="color: #0000ff;">Background</span>())
<span style="color: #a020f0;">if</span> <span style="color: #a0522d;">err</span> := result.<span style="color: #0000ff;">Error</span>(); err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#37324;raw&#23601;&#26159;http&#30340;&#21709;&#24212;body&#65292;json&#26684;&#24335;&#65292;&#21040;&#27492;&#65292;&#19968;&#20999;&#23601;&#22909;&#21150;&#20102;&#12290;</span>
<span style="color: #a020f0;">if</span> <span style="color: #a0522d;">raw</span>, <span style="color: #a0522d;">err</span> := result.<span style="color: #0000ff;">Raw</span>(); err != <span style="color: #008b8b;">nil</span> {
  <span style="color: #a020f0;">return</span> err
} <span style="color: #a020f0;">else</span> {
  fmt.<span style="color: #0000ff;">Println</span>(<span style="color: #0000ff;">string</span>(raw))
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2020-09-06 日 11:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
